// 八卦
export const BA_GUA = ['乾', '兑', '离', '震', '巽', '坎', '艮', '坤']

// 八卦卦爻转换
export const BA_GUA_2_YAO = {
    '乾': '111', '兑': '011', '离': '101', '震': '001', '巽': '110', '坎': '010', '艮': '100', '坤': '000',
    '111': '乾', '011': '兑', '101': '离', '001': '震', '110': '巽', '010': '坎', '100': '艮', '000': '坤',
}

// 八卦别称转换
export const BA_GUA_2_ALIAS = {
    '乾': '天', '兑': '泽', '离': '火', '震': '雷', '巽': '风', '坎': '水', '艮': '山', '坤': '地',
    '天': '乾', '泽': '兑', '火': '离', '雷': '震', '风': '巽', '水': '坎', '山': '艮', '地': '坤',
}

// 六十四卦
export const GUA_64 = [
    '天天乾卦', '天风姤', '天山遁', '天地否', '风地观', '山地剥', '火地晋', '火天大有',
    '泽泽兑卦', '泽水困', '泽地萃', '泽山咸', '水山蹇', '地山谦', '雷山小过', '雷泽归妹',
    '火火离卦', '火山旅', '火风鼎', '火水未济', '山水蒙', '风水涣', '天水讼', '天火同人',
    '雷雷震卦', '雷地豫', '雷水解', '雷风恒', '地风升', '水风井', '泽风大过', '泽雷随',
    '风风巽卦', '风天小畜', '风火家人', '风雷益', '天雷无妄', '火雷噬嗑', '山雷颐', '山风蛊',
    '水水坎卦', '水泽节', '水雷屯', '水火既济', '泽火革', '雷火丰', '地火明夷', '地水师',
    '山山艮卦', '山火贲', '山天大畜', '山泽损', '火泽睽', '天泽履', '风泽中孚', '风山渐',
    '地地坤卦', '地雷复', '地泽临', '地天泰', '雷天大壮', '泽天夬', '水天需', '水地比',
]

// 天干
export const TIAN_GAN = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸']
// 阳干
export const YANG_GAN = ['甲', '丙', '戊', '庚', '壬']
// 阴干
export const YIN_GAN = ['乙', '丁', '己', '辛', '癸']

// 地支
export const DI_ZHI = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥']
// 阳支
export const YANG_ZHI = ['子', '寅', '辰', '午', '申', '戌']
// 阴支
export const YIN_ZHI = ['丑', '卯', '巳', '未', '酉', '亥']

// 六十甲子
export const JIA_ZI = [
    '甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉',
    '甲戌', '乙亥', '丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未',
    '甲申', '乙酉', '丙戌', '丁亥', '戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳',
    '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥', '庚子', '辛丑', '壬寅', '癸卯',
    '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥', '壬子', '癸丑',
    '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥',
]

// 五行
export const WU_XING = {
    '乾': '金', '兑': '金', '离': '火', '震': '木', '巽': '木', '坎': '水', '艮': '土', '坤': '土',
    '天': '金', '泽': '金', '火': '火', '雷': '木', '风': '木', '水': '水', '山': '土', '地': '土',
    '甲': '木', '乙': '木', '丙': '火', '丁': '火', '戊': '土', '己': '土', '庚': '金', '辛': '金', '壬': '水', '癸': '水',
    '子': '水', '丑': '土', '寅': '木', '卯': '木', '辰': '土', '巳': '火', '午': '火', '未': '土', '申': '金', '酉': '金', '戌': '土', '亥': '水',
}

// 五行颜色
export const WU_XING_COLOR = {
    '木': '#509a79',
    '火': '#e05244',
    '土': '#967957',
    '金': '#f0a44e',
    '水': '#427bd5',
}
