// 天干
export const TIAN_GAN = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸']
// 阳干
export const YANG_GAN = ['甲', '丙', '戊', '庚', '壬']
// 阴干
export const YIN_GAN = ['乙', '丁', '己', '辛', '癸']

// 地支
export const DI_ZHI = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥']
// 阳支
export const YANG_ZHI = ['子', '寅', '辰', '午', '申', '戌']
// 阴支
export const YIN_ZHI = ['丑', '卯', '巳', '未', '酉', '亥']

// 六十甲子
export const JIA_ZI = [
    '甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉',
    '甲戌', '乙亥', '丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未',
    '甲申', '乙酉', '丙戌', '丁亥', '戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳',
    '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥', '庚子', '辛丑', '壬寅', '癸卯',
    '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥', '壬子', '癸丑',
    '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥',
]

// 五行
export const WU_XING = {
    '乾': '金', '兑': '金', '离': '火', '震': '木', '巽': '木', '坎': '水', '艮': '土', '坤': '土',
    '甲': '木', '乙': '木', '丙': '火', '丁': '火', '戊': '土', '己': '土', '庚': '金', '辛': '金', '壬': '水', '癸': '水',
    '子': '水', '丑': '土', '寅': '木', '卯': '木', '辰': '土', '巳': '火', '午': '火', '未': '土', '申': '金', '酉': '金', '戌': '土', '亥': '水',
}

// 五行颜色
export const WU_XING_COLOR = {
    '木': '#509a79',
    '火': '#e05244',
    '土': '#967957',
    '金': '#f0a44e',
    '水': '#427bd5',
}

// 十二长生
export const CHANG_SHENG = {
    '甲': { '子': '败', '丑': '冠', '寅': '禄', '卯': '旺', '辰': '衰', '巳': '病', '午': '死', '未': '墓', '申': '绝', '酉': '胎', '戌': '养', '亥': '生' },
    '乙': { '子': '病', '丑': '衰', '寅': '旺', '卯': '禄', '辰': '冠', '巳': '败', '午': '生', '未': '养', '申': '胎', '酉': '绝', '戌': '墓', '亥': '死' },
    '丙': { '子': '胎', '丑': '养', '寅': '生', '卯': '败', '辰': '冠', '巳': '禄', '午': '旺', '未': '衰', '申': '病', '酉': '死', '戌': '墓', '亥': '绝' },
    '丁': { '子': '绝', '丑': '墓', '寅': '死', '卯': '病', '辰': '衰', '巳': '旺', '午': '禄', '未': '冠', '申': '败', '酉': '生', '戌': '养', '亥': '胎' },
    '戊': { '子': '胎', '丑': '养', '寅': '生', '卯': '败', '辰': '冠', '巳': '禄', '午': '旺', '未': '衰', '申': '病', '酉': '死', '戌': '墓', '亥': '绝' },
    '己': { '子': '绝', '丑': '墓', '寅': '死', '卯': '病', '辰': '衰', '巳': '旺', '午': '禄', '未': '冠', '申': '败', '酉': '生', '戌': '养', '亥': '胎' },
    '庚': { '子': '死', '丑': '墓', '寅': '绝', '卯': '胎', '辰': '养', '巳': '生', '午': '败', '未': '冠', '申': '禄', '酉': '旺', '戌': '衰', '亥': '病' },
    '辛': { '子': '生', '丑': '养', '寅': '胎', '卯': '绝', '辰': '墓', '巳': '死', '午': '病', '未': '衰', '申': '旺', '酉': '禄', '戌': '冠', '亥': '败' },
    '壬': { '子': '旺', '丑': '衰', '寅': '病', '卯': '死', '辰': '墓', '巳': '绝', '午': '胎', '未': '养', '申': '生', '酉': '败', '戌': '冠', '亥': '禄' },
    '癸': { '子': '禄', '丑': '冠', '寅': '败', '卯': '生', '辰': '养', '巳': '胎', '午': '绝', '未': '墓', '申': '死', '酉': '病', '戌': '衰', '亥': '旺' },
}

// 空亡
export const KONG_WANG = {
    '甲': { '子': '戌亥', '寅': '子丑', '辰': '寅卯', '午': '辰巳', '申': '午未', '戌': '申酉' },
    '乙': { '丑': '戌亥', '卯': '子丑', '巳': '寅卯', '未': '辰巳', '酉': '午未', '亥': '申酉' },
    '丙': { '子': '申酉', '寅': '戌亥', '辰': '子丑', '午': '寅卯', '申': '辰巳', '戌': '午未' },
    '丁': { '丑': '申酉', '卯': '戌亥', '巳': '子丑', '未': '寅卯', '酉': '辰巳', '亥': '午未' },
    '戊': { '子': '午未', '寅': '申酉', '辰': '戌亥', '午': '子丑', '申': '寅卯', '戌': '辰巳' },
    '己': { '丑': '午未', '卯': '申酉', '巳': '戌亥', '未': '子丑', '酉': '寅卯', '亥': '辰巳' },
    '庚': { '子': '辰巳', '寅': '午未', '辰': '申酉', '午': '戌亥', '申': '子丑', '戌': '寅卯' },
    '辛': { '丑': '辰巳', '卯': '午未', '巳': '申酉', '未': '戌亥', '酉': '子丑', '亥': '寅卯' },
    '壬': { '子': '寅卯', '寅': '辰巳', '辰': '午未', '午': '申酉', '申': '戌亥', '戌': '子丑' },
    '癸': { '丑': '寅卯', '卯': '辰巳', '巳': '午未', '未': '申酉', '酉': '戌亥', '亥': '子丑' },
}

// 纳音
export const NA_YIN = {
    '甲': { '子': '海中金', '寅': '大溪水', '辰': '覆灯火', '午': '砂中金', '申': '泉中水', '戌': '山头火' },
    '乙': { '丑': '海中金', '卯': '大溪水', '巳': '覆灯火', '未': '砂中金', '酉': '泉中水', '亥': '山头火' },
    '丙': { '子': '涧下水', '寅': '炉中火', '辰': '沙中土', '午': '天河水', '申': '山下火', '戌': '屋上土' },
    '丁': { '丑': '涧下水', '卯': '炉中火', '巳': '沙中土', '未': '天河水', '酉': '山下火', '亥': '屋上土' },
    '戊': { '子': '霹雳火', '寅': '城头土', '辰': '大林木', '午': '天上火', '申': '大驿土', '戌': '平地木' },
    '己': { '丑': '霹雳火', '卯': '城头土', '巳': '大林木', '未': '天上火', '酉': '大驿土', '亥': '平地木' },
    '庚': { '子': '壁上土', '寅': '松柏木', '辰': '白蜡金', '午': '路旁土', '申': '石榴木', '戌': '钗钏金' },
    '辛': { '丑': '壁上土', '卯': '松柏木', '巳': '白蜡金', '未': '路旁土', '酉': '石榴木', '亥': '钗钏金' },
    '壬': { '子': '桑柘木', '寅': '金箔金', '辰': '长流水', '午': '杨柳木', '申': '剑锋金', '戌': '大海水' },
    '癸': { '丑': '桑柘木', '卯': '金箔金', '巳': '长流水', '未': '杨柳木', '酉': '剑锋金', '亥': '大海水' },
}

// 四柱部分 <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

// 藏干
export const CANG_GAN = {
    '子': ['癸'],
    '丑': ['己', '癸', '辛'],
    '寅': ['甲', '丙', '戊'],
    '卯': ['乙'],
    '辰': ['戊', '乙', '癸'],
    '巳': ['丙', '庚', '戊'],
    '午': ['丁', '己'],
    '未': ['己', '丁', '乙'],
    '申': ['庚', '壬', '戊'],
    '酉': ['辛'],
    '戌': ['戊', '辛', '丁'],
    '亥': ['壬', '甲'],
}

// 十神
export const SHI_SHEN = {
    '甲': { '甲': '比', '乙': '劫', '丙': '食', '丁': '伤', '戊': '才', '己': '财', '庚': '杀', '辛': '官', '壬': '枭', '癸': '印' },
    '乙': { '甲': '劫', '乙': '比', '丙': '伤', '丁': '食', '戊': '财', '己': '才', '庚': '官', '辛': '杀', '壬': '印', '癸': '枭' },
    '丙': { '甲': '枭', '乙': '印', '丙': '比', '丁': '劫', '戊': '食', '己': '伤', '庚': '才', '辛': '财', '壬': '杀', '癸': '官' },
    '丁': { '甲': '印', '乙': '枭', '丙': '劫', '丁': '比', '戊': '伤', '己': '食', '庚': '财', '辛': '才', '壬': '官', '癸': '杀' },
    '戊': { '甲': '杀', '乙': '官', '丙': '枭', '丁': '印', '戊': '比', '己': '劫', '庚': '食', '辛': '伤', '壬': '才', '癸': '财' },
    '己': { '甲': '官', '乙': '杀', '丙': '印', '丁': '枭', '戊': '劫', '己': '比', '庚': '伤', '辛': '食', '壬': '财', '癸': '才' },
    '庚': { '甲': '才', '乙': '财', '丙': '杀', '丁': '官', '戊': '枭', '己': '印', '庚': '比', '辛': '劫', '壬': '食', '癸': '伤' },
    '辛': { '甲': '财', '乙': '才', '丙': '官', '丁': '杀', '戊': '印', '己': '枭', '庚': '劫', '辛': '比', '壬': '伤', '癸': '食' },
    '壬': { '甲': '食', '乙': '伤', '丙': '才', '丁': '财', '戊': '杀', '己': '官', '庚': '枭', '辛': '印', '壬': '比', '癸': '劫' },
    '癸': { '甲': '伤', '乙': '食', '丙': '财', '丁': '才', '戊': '官', '己': '杀', '庚': '印', '辛': '枭', '壬': '劫', '癸': '比' },
}

// 六爻部分 <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

// 六亲
export const LIU_QIN = {
    '木': { '木': '兄弟', '火': '子孙', '土': '妻财', '金': '官鬼', '水': '父母' },
    '火': { '木': '父母', '火': '兄弟', '土': '子孙', '金': '妻财', '水': '官鬼' },
    '土': { '木': '官鬼', '火': '父母', '土': '兄弟', '金': '子孙', '水': '妻财' },
    '金': { '木': '妻财', '火': '官鬼', '土': '父母', '金': '兄弟', '水': '子孙' },
    '水': { '木': '子孙', '火': '妻财', '土': '官鬼', '金': '父母', '水': '兄弟' },
}

// 纳甲
export const NA_JIA = {
    '乾': ['甲子水', '甲寅木', '甲辰土', '壬午火', '壬申金', '壬戌土'],
    '坎': ['戊寅木', '戊辰土', '戊午火', '戊申金', '戊戌土', '戊子水'],
    '艮': ['丙辰土', '丙午火', '丙申金', '丙戌土', '丙子水', '丙寅木'],
    '震': ['庚子水', '庚寅木', '庚辰土', '庚午火', '庚申金', '庚戌土'],
    '巽': ['辛丑土', '辛亥水', '辛酉金', '辛未土', '辛巳火', '辛卯木'],
    '离': ['己卯木', '己丑土', '己亥水', '己酉金', '己未土', '己巳火'],
    '坤': ['乙未土', '乙巳火', '乙卯木', '癸丑土', '癸亥水', '癸酉金'],
    '兑': ['丁巳火', '丁卯木', '丁丑土', '丁亥水', '丁酉金', '丁未土'],
}

// 奇门部分 <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

// 奇仪
export const QI_YI = ['戊', '己', '庚', '辛', '壬', '癸', '丁', '丙', '乙']

// 旬首
export const XUN_SHOU = ['甲子戊', '甲戌己', '甲申庚', '甲午辛', '甲辰壬', '甲寅癸']

// 飞盘星
export const XING_F = ['蓬', '芮', '冲', '辅', '禽', '心', '柱', '任', '英']
// 转盘星
export const XING_Z = ['蓬', '任', '冲', '辅', '英', '芮', '柱', '心']

// 飞盘门
export const MEN_F = ['休', '死', '伤', '杜', '中', '开', '惊', '生', '景']
// 转盘门
export const MEN_Z = ['休', '生', '伤', '杜', '景', '死', '惊', '开']

// 飞盘神
export const SHEN_F = ['符', '蛇', '阴', '合', '陈', '常', '雀', '地', '天']
// 转盘神
export const SHEN_Z = ['符', '蛇', '阴', '合', '虎', '武', '地', '天']
